Repository: perez987/XSL-Transform
Catalog: XSLTransform/Resources/*.lproj/Localizable.strings
Languages: es

# app.title
source: XSL Transform
es: Transformación XSL

# app.subtitle
source: Convert XML to HTML using XSL transformation
es: Convertir XML a HTML usando transformación XSL

# xml.label
source: XML File:
es: Archivo XML:

# xsl.label
source: XSL Stylesheet:
es: Hoja de estilo XSL:

# output.label
source: Output HTML File:
es: Archivo HTML de salida:

source: No file selected
es: Ningún archivo seleccionado

# button.browse
source: Browse...
es: Examinar...

# button.use.sample
source: Use Sample
es: Usar ejemplo

# button.save.as
source: Save As...
es: Guardar como...

# button.transform
source: Transform
es: Transformar

# button.transforming
source: Transforming...
es: Transformando...

# button.ok
source: OK
es: Aceptar

# status.sample.xml.loaded
source: Sample XML file loaded
es: Archivo XML de ejemplo cargado

# status.sample.xsl.loaded
source: Sample XSL file loaded
es: Archivo XSL de ejemplo cargado

# status.xml.selected
source: XML file selected
es: Archivo XML seleccionado

# status.xsl.selected
source: XSL file selected
es: Archivo XSL seleccionado

# status.output.selected
source: Output file location selected
es: Ubicación del archivo de salida seleccionada

# status.transforming
source: Transforming...
es: Transformando...

# status.success
source: ✅ HTML file created at: %@
es: ✅ Archivo HTML creado en: %@

# status.failed
source: ❌ Transformation failed
es: ❌ No se ha podido crear el archivo HTML

# dialog.select.xml
source: Select XML file
es: Seleccionar archivo XML

# dialog.select.xsl
source: Select XSL stylesheet
es: Seleccionar hoja de estilo XSL

# dialog.save.html
source: Save HTML output as
es: Guardar salida HTML como

# error.sample.xml.not.found
source: Could not find sample XML file in resources
es: No se pudo encontrar el archivo XML de ejemplo en los recursos

# error.sample.xsl.not.found
source: Could not find sample XSL file in resources
es: No se pudo encontrar el archivo XSL de ejemplo en los recursos

# error.invalid.xml
source: Could not load or parse XML file
es: No se pudo cargar o analizar el archivo XML

# error.invalid.xsl
source: Could not load or parse XSL stylesheet
es: No se pudo cargar o analizar la hoja de estilo XSL

# error.transformation.failed
source: XSL transformation failed
es: Falló la transformación XSL

# error.file.write.failed
source: Could not write output HTML file
es: No se pudo escribir el archivo HTML de salida
